-- 查询所有字段
select * from user_info;
-- +---------+---------------+---------------+-----------+
-- | user_id | user_nickname | user_password | user_role |
-- +---------+---------------+---------------+-----------+
-- |       1 | admin         | admin         |         0 |
-- |       2 | nanshu        | 0209          |         0 |
-- +---------+---------------+---------------+-----------+

-- 只查询 指定字段
select user_nickname, user_role from user_info;
-- +---------------+-----------+
-- | user_nickname | user_role |
-- +---------------+-----------+
-- | admin         |         0 |
-- | nanshu        |         0 |
-- +---------------+-----------+